package pipewire

// Тут будет код для чтения с Pipewire, работающий тесно с процессом soma по такой схеме:
//
// 1. Мы сидим на сокете в s. Параллельно пишем буфер на n сек из самого pw поточно.
// 2. Видим сигнал в сокете, просыпаемся, смотрим на структуру, в ней лежит структура:

// | event_type         | uint8 | 1 байт |
// | ------------------ | ----- | ------ |
// | start_timestamp_ns | int64 | 8 байт |

// 3. Пока пропускаем мимо мозгов event_type, потому что MVP - значит один старт тип и все. Берем стампу.
// 4. Залезаем в буфер pw, можно даже пустить такое же потоковое чтение а не просто копирование и чтение скопированного, в том же буфере, с условием поиска time >= timestamp, благо pw за нас все придумали и сделали деление на кадры с номерочками
// 5. Найдя кадр, фиксируем флаг, или сразу переписываем так же потоково в куда то еще в структуру, все что идет после этого стампа, и сразу же весь этот поток мы можем не писать в структуру а мгновенно перекидывать в vad,
// 6. и по получению тишины, я так понимаю Vad сам вкинет сигнал стопа, и мы закончили чтение, вовзращаемся в обычный idle.
